In [1]:
import pandas as pd
import numpy as np

## Create Data

In [8]:
mydata={'col1':[1,2,3,4],
        'col2':[444,555,666,444],
        'col3':['abc','def','ghi','xyz']}

In [9]:
df = pd.DataFrame(data=mydata)

In [10]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

#### Add Index Name

In [11]:
df.index.name = 'Default'

In [12]:
df

         col1  col2 col3
Default
0           1   444  abc
1           2   555  def
2           3   666  ghi
3           4   444  xyz

## Find Unique Values

#### Using Unique

In [13]:
df.col2.unique()

array([444, 555, 666], dtype=int64)

## Count Number of Unique Values

#### Using Len

In [22]:
len(df.col2.unique())

3

#### nunique() method

In [23]:
df.col2.nunique()

3

## Value Counts

In [27]:
df.col2.value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

#### Create df from value_counts()

In [62]:
df.col2.value_counts().to_frame()

     col2
444     2
555     1
666     1